//=============================================================================
//
// アイテムの状態管理（バナナの皮）[BanananoKawaState.cpp]
// Author : 
//
//=============================================================================
#include "Main.h"
#include "BanananoKawaState.h"
#include "Input.h"

//=============================================================================
// コンストラクタ
//=============================================================================
BanananoKawaState::BanananoKawaState(Item *owner) : owner_(owner)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
BanananoKawaState::~BanananoKawaState()
{
	owner_ = nullptr;
}

//=============================================================================
// 更新
//=============================================================================
void BanananoKawaState::Update()
{
	//if (IsButtonTriggered(owner_->GetPlayer()->GetCtrlNum(), BUTTON_D) || GetKeyboardTrigger(DIK_I))
	//{
		D3DXVECTOR3 setpos = owner_->GetPlayer()->GetPos();
		owner_->GetPlayer()->GetFieldItemManager()->Set(NumKawa, setpos, D3DXVECTOR3(0.0f, 0.0f, 0.0f));
		// アイテムを使用
		owner_->Reset();
		// PlaySound(アイテム使用)
	//}
}

//=============================================================================
// 有効にするときだけ使う
//=============================================================================
void BanananoKawaState::Start()
{

}