//=============================================================================
//
// バトル画面フレーム表示処理 [Frame01.h]
// Author :  
//
//=============================================================================
#ifndef _FRAME01_H_
#define _FRAME01_H_

#include "_2dobj.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class Frame :
	public _2dobj {
public:
	Frame();
	~Frame();

	// オーバーライド関数
	void Update();
	void Draw();
	HRESULT MakeVertex();
	void SetTexture(int cntPattern);
	void SetVertex();

};

#endif